[
    {
        "riddle": "For some I go fast for others I'm slow. To most people, I'm an obsession relying on me is a well practiced lesson.  What am I?",
        "answer": "Time"
    },
    {
        "riddle": "I'm as big as an elephant, but lighter than a feather. What am I?",
        "answer": "The Wind"
    },
    {
        "riddle": "A blue house is made of blue bricks. A yellow house is made of yellow bricks. A red house is made of red bricks. An orange house is made of orange bricks. What would a green house be made of?",
        "answer": "Glass"
    },
    {
        "riddle": "What has roots as nobody sees.  Is taller than trees.  Up, up it goes.  And yet never grows?",
        "answer": "A Mountain"
    },
    {
        "riddle": "What is once in a minute, twice in a moment, and never in a thousand years?",
        "answer": "The letter M"
    },
    {
        "riddle": "Many things can create one, it can be of any shape or size, it is created for various reasons, and it can shrink or grow with time. What is it?",
        "answer": "A Hole"
    },
    {
        "riddle": "What can run but never walks, has a mouth but never talks, has a head but never weeps, has a bed but never sleeps?",
        "answer": "Water A river"
    },
    {
        "riddle": "What word can be written forward, backward or upside down, and can still be read from left to right?",
        "answer": "NOON"
    },
    {
        "riddle": "They have not flesh, nor feathers, nor scales, nor bone. Yet they have fingers and thumbs of their own. What are they?",
        "answer": "Gloves"
    },
    {
        "riddle": "I am large as a castle, yet lighter than air. 100 men and their horses cannot move me. What am I?",
        "answer": "The castle's shadow"
    },
    {
        "riddle": "This is as light as a feather, Yet no man can hold it for long. What is it?",
        "answer": "Your Breath"
    },
    {
        "riddle": "What is put on a table, cut, but never eaten?",
        "answer": "A deck of cards"
    },
    {
        "riddle": "This old one runs forever, but never moves at all. He has not lungs nor throat, but still a mighty roaring call. What is it?",
        "answer": "A Waterfall"
    },
    {
        "riddle": "Whoever makes it, tells it not. Whoever takes it, knows it not. And whoever knows it wants it not.",
        "answer": "Counterfeit money"
    },
    {
        "riddle": "I come in darkness, but fill the mind with light. I bring enlightenment to some, while gripping others in the hand of fear. With me it can be a journey of inexplicable joy and sorrow. What I will show you will often be unreachable. Journey with me and what you see may haunt you. Journey with me and you may never want to return home. Journey with me and you will never know when it will end. What am I?",
        "answer": "Your dreams"
    },
    {
        "riddle": "What can be swallowed, but can also swallow you?",
        "answer": "Pride"
    },
    {
        "riddle": "What can go up a chimney down, but cannot go down a chimney up?",
        "answer": "An umbrella"
    },
    {
        "riddle": "What never gets any wetter, no matter how much it rains?",
        "answer": "The sea"
    },
    {
        "riddle": "No sooner spoken than broken. What is it?",
        "answer": "Silence"
    },
    {
        "riddle": "When they are caught, they are thrown away. When they escape, you itch all day. What are they?",
        "answer": "Fleas"
    },
    {
        "riddle": "You hear it speak, for it has a hard tongue. But it cannot breathe, for it has not a lung. What is it?",
        "answer": "A Bell"
    },
    {
        "riddle": "What is it that is deaf, dumb and blind and always tells the truth?",
        "answer": "A Mirror"
    },
    {
        "riddle": "Inside a burning house, this thing is best to make. And best to make it quickly, before the fire's too much to take!",
        "answer": "Haste!"
    },
    {
        "riddle": "What gets whiter the dirtier that it gets?",
        "answer": "A chalkboard"
    },
    {
        "riddle": "Which word in the English language becomes shorter when it is lengthened?",
        "answer": "Short"
    },
    {
        "riddle": "What is red and blue, and purple and green? No one can reach it, not even the queen?",
        "answer": "A Rainbow"
    },
    {
        "riddle": "There is an ancient invention still used in some parts of the world today that allows people to see through walls. What is it?",
        "answer": "A window"
    },
    {
        "riddle": "At night they come without being fetched, And by day they are lost without being stolen.",
        "answer": "The stars"
    },
    {
        "riddle": "Different lights do make me strange, thus into different sizes I will change. What am I?",
        "answer": "the pupil of an eye"
    },
    {
        "riddle": "I'm so fast you can't see me, Though everyone sees straight through me, I don't stop until the day you die. What am I?",
        "answer": "A blink of an eye"
    },
    {
        "riddle": "You have three stoves: a gas stove, a wood stove, and a coal stove, but only one match. Which should you light first?",
        "answer": "The match!"
    },
    {
        "riddle": "What is it the more you take, the more you leave behind?",
        "answer": "Footsteps"
    },
    {
        "riddle": "I have a big mouth and I am also quite loud! I am NOT a gossip but I do get involved with everyone's dirty business. Can you name me?",
        "answer": "Vacuum Cleaner"
    },
    {
        "riddle": "What can burn the eyes, sting the mouth, yet be consumed?",
        "answer": "Salt"
    },
    {
        "riddle": "I am served at a table, In gatherings of two or four; Served small, white and round. You'll love some, And that's part of the fun. What am I?",
        "answer": "Ping Pong Balls"
    },
    {
        "riddle": "What always goes to bed with shoes on?",
        "answer": "A Horse"
    },
    {
        "riddle": "What do you use to hoe a row, slay a foe, and wring with woe?",
        "answer": "Your hands"
    },
    {
        "riddle": "Who makes it, has no need of it. Who buys it, has no use for it. Who uses it can neither see nor feel it.",
        "answer": "A Coffin"
    },
    {
        "riddle": "What has no beginning, end, or middle?",
        "answer": "A doughnut"
    },
    {
        "riddle": "Who is it that rows quickly with four oars but never comes out from under his own roof?",
        "answer": "A Turtle"
    },
    {
        "riddle": "You use it between your head and your toes, the more it works the thinner it grows. What is it?",
        "answer": "A Bar of Soap"
    },
    {
        "riddle": "What object has keys that open no locks, space but no room, and you can enter but not go in?",
        "answer": "A keyboard"
    },
    {
        "riddle": "Big as a biscuit, deep as a cup, even a river can't fill it up. What is it?",
        "answer": "A kitchen strainer"
    },
    {
        "riddle": "What can bring back the dead; make us cry, make us laugh, make us young; born in an instant yet lasts a life time?",
        "answer": "Memories"
    },
    {
        "riddle": "It is said among my people that some things are improved by death. Tell me, what stinks while living, but in death, smells good?",
        "answer": "A Pig"
    },
    {
        "riddle": "What has one foot on each side and one in the middle?",
        "answer": "A yardstick"
    },
    {
        "riddle": "What kind of rocks does Frankenstein have in his collection?",
        "answer": "Tombstones"
    },
    {
        "riddle": "What stays where it is when it goes off?",
        "answer": "A Gun"
    },
    {
        "riddle": "What goes through the door without pinching itself? What sits on the stove without burning itself? What sits on the table and is not ashamed?",
        "answer": "The Sun"
    },
    {
        "riddle": "Hands she has but does not hold, teeth she has but does not bite, feet she has but they are cold, eyes she has but without sight. Who is she?",
        "answer": "A Doll"
    }
]
